inblat/STM32_FOC_ACIM/src/stm32f10x_tacho.c
/******************** (C) COPYRIGHT 2007 STMicroelectronics ********************
* File Name          : stm32f10x_tacho.c
* Author             : IMS Systems Lab & MCD Application Team 
* Date First Issued  : 11/28/2007
* Description        : Module handling speed feedback provided by a
                       tachogenerator.
********************************************************************************
* History:
* 11/28/07 v1.0
* 05/29/08 v2.0
********************************************************************************
* THE PRESENT SOFTWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*
* THIS SOURCE CODE IS PROTECTED BY A LICENSE.
* FOR MORE INFORMATION PLEASE CAREFULLY READ THE LICENSE AGREEMENT FILE LOCATED
* IN THE ROOT DIRECTORY OF THIS FIRMWARE PACKAGE.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_lib.h"
#include "stm32f10x_tacho.h"
#include "MC_tacho_prm.h"
#include "MC_globals.h"
#include "stm32f10x_MClib.h"
#include "MC_acmotor_prm.h"

/* Private define ------------------------------------------------------------*/
#define TIMx_PRE_EMPTION_PRIORITY 2
#define TIMx_SUB_PRIORITY 0

#define LOW_RES_THRESHOLD   ((u16)0x5500u)// If capture below, ck prsc decreased
#define	ROTOR_SPEED_FACTOR  ((u32)((POLE_PAIR_NUM * (CKTIM*10)) / TACHO_PULSE_PER_REV))
#define PSEUDO_FREQ_CONV    ((u32)(ROTOR_SPEED_FACTOR / (SAMPLING_FREQ * 10)) * 0x10000uL)
#define SPEED_OVERFLOW      ((u32)(ROTOR_SPEED_FACTOR / MAX_SPEED_FDBK))
#define MAX_PERIOD          ((u32)((CKTIM * 10) / MIN_SPEED_FDBK))
#define TACHO_COUNTER_RESET ((u8)0)
#define ICx_FILTER          (u8) 6

// Here is practically assigned the tacho timer
#if defined(TIMER2_HANDLES_TACHO)
    #define TACHO_TIMER TIM2
#elif defined(TIMER3_HANDLES_TACHO)
    #define TACHO_TIMER TIM3
#else // TIMER4_HANDLES_TACHO
    #define TACHO_TIMER TIM4
#endif

// Here is practically assigned the tacho timer input channel
#if defined(TACHO_INPUT_TI1)
    #define TIM_IT_CC TIM_IT_CC1
#elif defined(TACHO_INPUT_TI2)
    #define TIM_IT_CC TIM_IT_CC2
#endif

// To avoid obvious initialization errors...
#if  ( (defined(TIMER2_HANDLES_TACHO) && defined(TIMER3_HANDLES_TACHO)) \
    || (defined(TIMER2_HANDLES_TACHO) && defined(TIMER4_HANDLES_TACHO)) \
    || (defined(TIMER3_HANDLES_TACHO) && defined(TIMER4_HANDLES_TACHO)))
  #error "Invalid tacho setup: 2 timers selected"
#endif

// To avoid obvious initialization errors...
#if  ( (defined(TACHO_INPUT_TI1) && defined(TACHO_INPUT_TI2)) ) 
    #error "Invalid tacho setup: 2 inputs selected"
#endif

/* Private macro -------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
typedef struct {
	u16 hCapture;
	u16 hPrscReg;
	} SpeedMeas_s;

/* Private variables ---------------------------------------------------------*/

volatile SpeedMeas_s SensorPeriod[SPEED_FIFO_SIZE]; // Holding the last captures
vu8 bSpeedFIFO_Index;   // Index of above array
vu8 bGP1_OVF_Counter;   // Count overflows if prescaler is too low
vu16 hCaptCounter;      // Holds the number of tacho interrupts

volatile bool RatioDec;
volatile bool RatioInc;
volatile bool DoRollingAverage;
volatile bool InitRollingAverage;
volatile bool TachoTimeOut;

/* Private function prototypes -----------------------------------------------*/
u32 GetLastTachoPeriod(void);
u32 GetAvrgTachoPeriod(void);


/*******************************************************************************
* Function Name  : TAC_TachoTimerInit
* Description    : Initializes the timer handling tacho feedback
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TAC_TachoTimerInit(void)
{

  TIM_TimeBaseInitTypeDef TIM_TACTimeBaseInitStructure;
  TIM_ICInitTypeDef       TIM_TACICInitStructure;
  NVIC_InitTypeDef        NVIC_InitTACStructure;
  GPIO_InitTypeDef        GPIO_InitStructure;
  
  #if defined(TIMER2_HANDLES_TACHO)
    /* TIM2 clock source enable */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
  #elif defined(TIMER3_HANDLES_TACHO)
    /* TIM3 clock source enable */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
  #else // TIMER4_HANDLES_TACHO
    /* TIM4 clock source enable */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
  #endif
    
  // The following lines work properly if tacho signal output is connected to PA0
  GPIO_StructInit(&GPIO_InitStructure);
  /* Configure PA.00 as tacho input */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOA, &GPIO_InitStructure);  
  
  // Timer configuration in Clear on capture mode
  TIM_DeInit(TACHO_TIMER);
  
  TIM_TimeBaseStructInit(&TIM_TACTimeBaseInitStructure);
  TIM_ICStructInit(&TIM_TACICInitStructure);
  
  #if defined(TACHO_INPUT_TI1)
    TIM_TACICInitStructure.TIM_Channel = TIM_Channel_1;
  #elif defined(TACHO_INPUT_TI2)
    TIM_TACICInitStructure.TIM_Channel = TIM_Channel_2;
  #endif
  
  TIM_TACTimeBaseInitStructure.TIM_Period = U16_MAX;  // Set full 16-bit working range
  
  TIM_TACICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Falling;
  TIM_TACICInitStructure.TIM_ICFilter = ICx_FILTER;

   TIM_TimeBaseInit(TACHO_TIMER,&TIM_TACTimeBaseInitStructure);
   TIM_ICInit(TACHO_TIMER,&TIM_TACICInitStructure);
   
