inblat/STM32_FOC_ACIM/src/stm32f10x_tacho.c
   // Force the TACHO_TIMER prescaler with immediate access (no need of an update event) 
   TIM_PrescalerConfig(TACHO_TIMER, (u16) MAX_RATIO, TIM_PSCReloadMode_Immediate);
   
   TIM_InternalClockConfig(TACHO_TIMER);
   
   #if defined(TACHO_INPUT_TI1)
    TIM_SelectInputTrigger(TACHO_TIMER, TIM_TS_TI1FP1);
   #else //TACHO_INPUT_TI2
    TIM_SelectInputTrigger(TACHO_TIMER, TIM_TS_TI2FP2);
   #endif 

   TIM_SelectSlaveMode(TACHO_TIMER,TIM_SlaveMode_Reset);
   
   // Source of Update event is only counter overflow/underflow
   TIM_UpdateRequestConfig(TACHO_TIMER, TIM_UpdateSource_Regular);
    
  /* Enable the TACHO_TIMER IRQChannel*/
  #if defined(TIMER2_HANDLES_TACHO)
    NVIC_InitTACStructure.NVIC_IRQChannel = TIM2_IRQChannel;
  #elif defined(TIMER3_HANDLES_TACHO)
    NVIC_InitTACStructure.NVIC_IRQChannel = TIM3_IRQChannel;
  #else // TIMER4_HANDLES_TACHO
    NVIC_InitTACStructure.NVIC_IRQChannel = TIM4_IRQChannel;
  #endif

  NVIC_InitTACStructure.NVIC_IRQChannelPreemptionPriority =  TIMx_PRE_EMPTION_PRIORITY;
  NVIC_InitTACStructure.NVIC_IRQChannelSubPriority = TIMx_SUB_PRIORITY;
  NVIC_InitTACStructure.NVIC_IRQChannelCmd = ENABLE;
  
  NVIC_Init(&NVIC_InitTACStructure);
  
  // Clear the TIMx's pending flags
  TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_Update);
  TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_CC1);
  TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_CC2); 
  TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_CC3); 
  TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_CC4);
TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_Trigger);
TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_CC1OF);
TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_CC2OF);
TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_CC3OF);
TIM_ClearFlag(TACHO_TIMER,  TIM_FLAG_CC4OF);

//+ TIM_FLAG_Trigger + TIM_FLAG_CC1OF + \
                //TIM_FLAG_CC2OF + TIM_FLAG_CC3OF + TIM_FLAG_CC4OF);
  
  // Selected input capture and Update (overflow) events generate interrupt
  TIM_ITConfig(TACHO_TIMER, TIM_IT_CC, ENABLE);
  TIM_ITConfig(TACHO_TIMER, TIM_IT_Update, ENABLE);

  TACHO_TIMER->CNT = TACHO_COUNTER_RESET;
  
}


/*******************************************************************************
* ROUTINE Name : TAC_InitTachoMeasure
*
* Description : Clear software FIFO where are "pushed" latest speed informations
*           This function must be called before starting the motor to initialize
*	    the speed measurement process.
*
* Input       : None
* Output      : None
* Return      : None
* Note        : First measurements following this function call will be done
*               without filtering (no rolling average).
*******************************************************************************/
void TAC_InitTachoMeasure( void )
{
   // Mask interrupts to insure a clean intialization
   
   TIM_ITConfig(TACHO_TIMER, TIM_IT_CC, DISABLE);
   
  
   RatioDec = FALSE;
   RatioInc = FALSE;
   DoRollingAverage = FALSE;
   InitRollingAverage = FALSE;
   TachoTimeOut = FALSE;

   hCaptCounter = 0;
   bGP1_OVF_Counter = 0;

   for (bSpeedFIFO_Index=0; bSpeedFIFO_Index < SPEED_FIFO_SIZE; bSpeedFIFO_Index++)
   {
      SensorPeriod[bSpeedFIFO_Index].hCapture = U16_MAX;
      SensorPeriod[bSpeedFIFO_Index].hPrscReg = MAX_RATIO;
   }

   // First measurement will be stored in the 1st array location
   bSpeedFIFO_Index = SPEED_FIFO_SIZE-1;

   // Re-initialize partly the timer
   TACHO_TIMER->PSC = MAX_RATIO;
   
   // TIM_ResetCounter(TACHO_TIMER);
   TACHO_TIMER->CNT = TACHO_COUNTER_RESET;
   
   TIM_Cmd(TACHO_TIMER, ENABLE);
   
   TIM_ITConfig(TACHO_TIMER, TIM_IT_CC, ENABLE);

}


/*******************************************************************************
* ROUTINE Name : TAC_GetRotorFreqInHz
*
* Description : This routine returns Rotor frequency with [0.1Hz] definition.
*		Result is given by the following formula:
*		Frotor = K x (Fosc / (Capture x number of overflow)))
*		where K depends on the number of motor and tacho poles pairs
*
* Input    : None
* Output   : None
* Returns  : Rotor mechanical frequency, with 0.1Hz resolution.
* Comments : Result is zero if speed is too low (glitches at start for instance)
*           Excessive speed (or high freq glitches will result in a pre-defined
*           value returned.
* Warning : Maximum expectable accuracy depends on CKTIM: 72MHz will give the
* 	    best results.
*******************************************************************************/
u16 TAC_GetRotorFreqInHz ( void )
{
   u32 wFreqBuffer;
   u16 hRotorFreq;

   if ( DoRollingAverage)
   {
      wFreqBuffer = GetAvrgTachoPeriod();
   }
   else
   {  // Raw tacho period
      wFreqBuffer = GetLastTachoPeriod();
   }

   if (TachoTimeOut == TRUE)
   {
      hRotorFreq = 0;
   }
   else
   {
      if ( TACHO_TIMER->PSC >= MAX_RATIO ) /* At start-up or very low freq */
      {                           /* Based on current prescaler value only */
         hRotorFreq = 0;
      }
      else
      {
         if( wFreqBuffer > MAX_PERIOD) /* Speed is too low */
         {
            hRotorFreq = 0;
         }
         else
         {
            if ( wFreqBuffer <= (u32)SPEED_OVERFLOW ) /*Avoid u32 DIV Overflow*/
            {
               hRotorFreq = MAX_SPEED;
            }
            else
            {
               hRotorFreq = (u16) ( ROTOR_SPEED_FACTOR / wFreqBuffer );
            }
         }
      }
   }

   return (hRotorFreq);
}


/*******************************************************************************
* ROUTINE Name : TAC_GetRotorFreq
*
* Description : This routine returns Rotor frequency with an unit that can be
*               directly integrated t oget the speed in the main control loop.
*
* Input    : None
* Output   : None
* Returns  : Rotor mechanical frequency with rad/PWM period unit
*             (here 2*PI rad = 0xFFFF).
* Comments : Result is zero if speed is too low (glitches at start for instance)
*           Excessive speed (or high freq glitches will result in a pre-defined
*           value returned.
* Warning : Maximum expectable accuracy depends on CKTIM: 60MHz will give the
* 	    best results.
*******************************************************************************/
u16 TAC_GetRotorFreq ( void )
{
   u32 wFreqBuffer;
   u16 hRotorFreq;

   if ( DoRollingAverage)
   {
      wFreqBuffer = GetAvrgTachoPeriod();
   }
   else
   {  // Raw tacho period
      wFreqBuffer = GetLastTachoPeriod();
   }

