inblat/STM32_FOC_ACIM/src/stm32f10x_tacho.c
   if (TachoTimeOut == TRUE)
   {
      hRotorFreq = 0;
   }
   else
   {
      if ( TACHO_TIMER->PSC >= MAX_RATIO ) /* At start-up or very low freq */
      {                           /* Based on current prescaler value only */
         hRotorFreq = 0;
      }
      else
      {
         if( wFreqBuffer > MAX_PERIOD) /* Speed is too low */
         {
            hRotorFreq = 0;
         }
         else
         {
            if ( wFreqBuffer <= (u32)SPEED_OVERFLOW )/*Avoid u32 DIV Overflow*/
            {
               hRotorFreq = MAX_PSEUDO_SPEED;
            }
            else
            {
               hRotorFreq = ((u16) (PSEUDO_FREQ_CONV / wFreqBuffer) );
            }
         }
      }
   }

   return (hRotorFreq);
}


/*******************************************************************************
* ROUTINE Name : TAC_ClrTimeOut
*
* Description     : Clears the flag indicating that that informations are lost,
*                   or speed is decreasing sharply.
* Input           : None
* Output          : Clear TachoTimeOut
* Return          : None
*******************************************************************************/
void TAC_ClrTimeOut(void)
{
   TachoTimeOut = FALSE;
}


/*******************************************************************************
* ROUTINE Name : TAC_IsTimedOut
*
* Description     : Indicates to the upper layer SW that tacho informations
*                   disappeared (for a while at least).
* Input           : None
* Output          : None
* Return          : boolean, TRUE in case of Time Out
* Note            : The time-out duration depends on tacho timer pre-scaler,
*                   which is variable; the time-out will be higher at low speed.
*******************************************************************************/
bool TAC_IsTimedOut(void)
{
   return(TachoTimeOut);
}


/*******************************************************************************
* ROUTINE Name : TAC_GetCaptCounter
*
* Description     : Gives the number of tacho capture interrupts since last call
*                   of the TAC_ClrCaptCounter function.
* Input           : None
* Output          : None
* Return          : u16 integer (Roll-over is prevented in the tacho capture
*                   routine itself).
*******************************************************************************/
u16 TAC_GetCaptCounter(void)
{
   return(hCaptCounter);
}


/*******************************************************************************
* ROUTINE Name : TAC_ClrCaptCounter
*
* Description     : Clears the variable holding the number of capture events.
* Input           : None
* Output          : hCaptCounter is cleared.
* Return          : None
*******************************************************************************/
void TAC_ClrCaptCounter(void)
{
   hCaptCounter = 0;
}


/*******************************************************************************
* ROUTINE Name : GetLastTachoPeriod
*
* Description     : returns the rotor pseudo-period based on last tacho capture
* Input           : None
* Output          : None
* Return          : rotor pseudo-period, as a number of CKTIM periods
*******************************************************************************/
u32 GetLastTachoPeriod(void)
{
      u32 wFreqBuffer;
      u8 bLastSpeedFIFO_Index;

   // Store current index to prevent errors if Capture occurs during processing
   bLastSpeedFIFO_Index = bSpeedFIFO_Index;

   // This is done assuming interval between captures is higher than time
   // to read the two values
   wFreqBuffer = SensorPeriod[bLastSpeedFIFO_Index].hCapture;
   wFreqBuffer *= (SensorPeriod[bLastSpeedFIFO_Index].hPrscReg + 1);

   return (wFreqBuffer);
}


/*******************************************************************************
* ROUTINE Name : GetAvrgTachoPeriod
*
* Description    : returns the rotor pseudo-period based on 4 last tacho capture
* Input          : None
* Output         : None
* Return         : averaged rotor pseudo-period, as a number of CKTIM periods
* Side effect: the very last tacho period acquired may not be considered for the
* calculation if a capture occurs during averaging.
*******************************************************************************/
u32 GetAvrgTachoPeriod(void)
{
    u32 wFreqBuffer, wAvrgBuffer, wIndex;

  wAvrgBuffer = 0;

  for ( wIndex = 0; wIndex < SPEED_FIFO_SIZE; wIndex++ )
  {
     // Disable capture interrupts to have presc and capture of the same period
     
     TACHO_TIMER->DIER &= ~TIM_IT_CC;     // NB:Std libray not used for perf issues
     
     wFreqBuffer = SensorPeriod[wIndex].hCapture;
     wFreqBuffer *= (SensorPeriod[wIndex].hPrscReg + 1);
     
     TACHO_TIMER->DIER |= TIM_IT_CC;     // NB:Std libray not used for perf issues
     
     wAvrgBuffer += wFreqBuffer;	// Sum the whole tacho period FIFO
  }
  wAvrgBuffer += (SPEED_FIFO_SIZE/2)-1;  // Round to upper value
  wAvrgBuffer /= SPEED_FIFO_SIZE;        // Average value	
  return (wAvrgBuffer);
}


/*******************************************************************************
* ROUTINE Name : TAC_StartTachoFiltering
*
* Description : Set the flags to initiate tacho values smoothing mechanism.
* Input       : None
* Output      : The result of the next capture will be copied in the whole array
*               to have 1st average = last value.
* Return      : None
* Note: The initialization of the FIFO used to do the averaging will be done
*       when the next tacho capture interrupt will occur.
*******************************************************************************/
void TAC_StartTachoFiltering( void )
{
   InitRollingAverage = TRUE;
}


/*******************************************************************************
* ROUTINE Name : TAC_ValidSpeedInfo
*
* Description : Used in Start function to know if rotor shaft turns at the right
*               speed.
*
* Input       : Rotor frequency (0.1Hz resolution) above which speed information
*               is not considered reliable (tacho signal too weak).
* Output      : None
* Return      : Boolean, TRUE if tacho provides clean signals.
*
* Warning : Since there's no way to differentiate rotation direction with a
*           tachogenerator, user must be aware that this routine may return TRUE
*           in certain conditions (re-start with no/very short stop time before
*           and high inertia load), even if motor is not started in the right
*           condition. User should therefore manage a minimal amout of time
*           before re-starting.
*           NB: this function may be unefficient if start-up duration is far
*           shorter than time needed to have at least two consecutive speed info
*******************************************************************************/
bool TAC_ValidSpeedInfo( u16 hMinRotorFreq )
{
      bool IsValid;

   TachoTimeOut = FALSE;  // Time-out flag is not significant during start-up

