inblat/STM32_FOC_ACIM/src/stm32f10x_tacho.c
   if ( hMinRotorFreq == 0 ) // Error
   {
      IsValid = FALSE;
   }
   else			// Right start conditions in closed loop:
   {
      if (TAC_GetRotorFreqInHz() > hMinRotorFreq)
      {
         // Decreasing tacho period means accelerating motor
         if (GetAvrgTachoPeriod() >= GetLastTachoPeriod())
         {
            IsValid = TRUE;
         }
         else
         {
            IsValid = FALSE;
         }
      }
      else
      {
         IsValid = FALSE;
      }
   }
   return (IsValid);
}

#ifdef TACHO

/*******************************************************************************
* Function Name  : TIMx_IRQHandler
* Description    : This function handles both the capture event and Update event 
*                  interrupt handling the tacho signal period measurement.
*                  
*                  - On 'CAPTURE' event case:
*                    If the average is initialized, the last captured measure is
*                    copied into the whole array.
*                    Period captures are managed as following:
*                    If too low, the clock prescaler is decreased for next measure
*                    If too high (ie there was overflows), the result is
*                    re-computed as if there was no overflow and the prescaler is
*                    increased to avoid overflows during the next capture
*                   
*                  - On 'UPDATE' event case:
*                    This function handles the overflow of the timer handling
*                    the tacho signal period measurement.
* Input          : 
*                  - On 'CAPTURE' event case:
*                    None
*                   
*                  - On 'UPDATE' event case: 
*                    None
*
* Output         : 
*                  - On 'CAPTURE' event case:
*                   Updates the array holding the 4 latest period measures, reset
*                   the overflow counter and update the clock prescaler to
*                   optimize the accuracy of the measurement.
*                   
*                  - On 'UPDATE' event case:
*                    Updates a Counter of overflows, handled and reset when next
*                    capture occurs. 
*
* Return         : None (Interrupt Service routine)
*******************************************************************************/
#if defined(TIMER2_HANDLES_TACHO)
void TIM2_IRQHandler(void)
#elif defined(TIMER3_HANDLES_TACHO)
void TIM3_IRQHandler(void)
#else // TIMER4_HANDLES_TACHO
void TIM4_IRQHandler(void)
#endif

{
// Check for the source of TIMx int - Capture or Update Event - 
if ( TIM_GetFlagStatus(TACHO_TIMER, TIM_FLAG_Update) == RESET )
{

   // A capture event occured for this interrupt request generation
  #if defined(TACHO_INPUT_TI1)
    TIM_ClearFlag(TACHO_TIMER, TIM_FLAG_CC1);
  #elif defined(TACHO_INPUT_TI2)
    TIM_ClearFlag(TACHO_TIMER, TIM_FLAG_CC2);
  #endif   

   if (hCaptCounter < U16_MAX)
   {
      hCaptCounter++;
   }

   // Compute new array index
   if (bSpeedFIFO_Index < SPEED_FIFO_SIZE-1)
   {
      bSpeedFIFO_Index++;
   }
   else
   {
      bSpeedFIFO_Index = 0;
   }

   // Store the latest speed acquisition
   if (bGP1_OVF_Counter != 0)	// There was counter overflow before capture
   {
        u32 wCaptBuf;
        u16 hPrscBuf;

      #if defined(TACHO_INPUT_TI1)
        wCaptBuf = (u32)TIM_GetCapture1(TACHO_TIMER);
      #elif defined(TACHO_INPUT_TI2)
        wCaptBuf = (u32)TIM_GetGetCapture2(TACHO_TIMER);
      #endif
      
      hPrscBuf = TACHO_TIMER->PSC;

      while (bGP1_OVF_Counter != 0)
      {
         wCaptBuf += 0x10000uL;// Compute the real captured value (> 16-bit)
         bGP1_OVF_Counter--;
         // OVF Counter is 8-bit and Capt is 16-bit, thus max CaptBuf is 24-bits
      }
      while(wCaptBuf > U16_MAX)
      {
         wCaptBuf /= 2;		// Make it fit 16-bit using virtual prescaler
         // Reduced resolution not a problem since result just slightly < 16-bit
         hPrscBuf = (hPrscBuf * 2) + 1;
         if (hPrscBuf > U16_MAX/2) // Avoid Prsc overflow
         {
            hPrscBuf = U16_MAX;
            wCaptBuf = U16_MAX;
         }
      }
      SensorPeriod[bSpeedFIFO_Index].hCapture = wCaptBuf;
      SensorPeriod[bSpeedFIFO_Index].hPrscReg = hPrscBuf;
      if (RatioInc)
      {
         RatioInc = FALSE;	// Previous capture caused overflow
         // Don't change prescaler (delay due to preload/update mechanism)
      }
      else
      {
         if ((TACHO_TIMER->PSC) < MAX_RATIO) // Avoid OVF w/ very low freq
         {
            (TACHO_TIMER->PSC)++; // To avoid OVF during speed decrease
            RatioInc = TRUE;	  // new prsc value updated at next capture only
         }
      }
   }
   else		// No counter overflow
   {
        u16 hHighSpeedCapture, hClockPrescaler;

      // Read period since last tacho edge
      
      #if defined(TACHO_INPUT_TI1)
        hHighSpeedCapture = (u32)TIM_GetCapture1(TACHO_TIMER);
        
      #elif defined(TACHO_INPUT_TI2)
        hHighSpeedCapture = (u32)TIM_GetGetCapture2(TACHO_TIMER);
      #endif
        
      SensorPeriod[bSpeedFIFO_Index].hCapture = hHighSpeedCapture;
      // Store prescaler directly or incremented if value changed on last capt
      hClockPrescaler = TACHO_TIMER->PSC;

      // If prsc preload reduced in last capture, store current register + 1
      if (RatioDec)  // and don't decrease it again
      {
         SensorPeriod[bSpeedFIFO_Index].hPrscReg = (hClockPrescaler)+1;
         RatioDec = FALSE;
      }
      else  // If prescaler was not modified on previous capture
      {
         if (hHighSpeedCapture >= LOW_RES_THRESHOLD)// If capture range correct
         {
            SensorPeriod[bSpeedFIFO_Index].hPrscReg = hClockPrescaler;
         }
         else
         {
            if(TACHO_TIMER->PSC == 0) // or prescaler cannot be further reduced
            {
               SensorPeriod[bSpeedFIFO_Index].hPrscReg = hClockPrescaler;
            }
            else  // The prescaler needs to be modified to optimize the accuracy
            {
               SensorPeriod[bSpeedFIFO_Index].hPrscReg = hClockPrescaler;
               (TACHO_TIMER->PSC)--;	// Increase accuracy by decreasing prsc
               // Avoid decrementing again in next capt.(register preload delay)
               RatioDec = TRUE;
            }
         }
      }
   }

   if (InitRollingAverage)
   {
        u16 hCaptBuf, hPrscBuf;
        u32 wIndex;
      // Read last captured value and copy it into the whole array
      hCaptBuf = SensorPeriod[bSpeedFIFO_Index].hCapture;
      hPrscBuf = SensorPeriod[bSpeedFIFO_Index].hPrscReg;
      for (wIndex = 0; wIndex<SPEED_FIFO_SIZE-1; wIndex++)
      {
         SensorPeriod[wIndex].hCapture = hCaptBuf;
         SensorPeriod[wIndex].hPrscReg = hPrscBuf;
      }
      InitRollingAverage = FALSE;
      // Starting from now, the values returned by MTC_GetRotorFreq are averaged
      DoRollingAverage = TRUE;
  }
}
else // an update event occured for this interrupt request generation
{
  TIM_ClearFlag(TIM2, TIM_FLAG_Update);

  if (bGP1_OVF_Counter < U8_MAX)
  {
     bGP1_OVF_Counter++;
  }

  if (bGP1_OVF_Counter >= MAX_OVERFLOWS)
  {
     TachoTimeOut = TRUE;
  }
}
}


#endif // TACHO defined

/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
